# GetSpatialElementBoundaryLocation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaVolumeSettings..::..GetSpatialElementBoundaryLocation Method
AreaVolumeSettings Class See Also
---
Gets the spatial element boundary location based on spatial element type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public SpatialElementBoundaryLocation GetSpatialElementBoundaryLocation(
	SpatialElementType spType
)
```

Visual Basic
---
```text
Public Function GetSpatialElementBoundaryLocation ( _
	spType As SpatialElementType _
) As SpatialElementBoundaryLocation
```

Visual C++
---
```text
public:
SpatialElementBoundaryLocation GetSpatialElementBoundaryLocation(
	SpatialElementType spType
)
```

# ### Parameters
spType
    Type: Autodesk.Revit.DB..::..SpatialElementType The spatial element type.
# ### Return Value
The boundary location.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AreaVolumeSettings Class
Autodesk.Revit.DB Namespace